while True:
    '''Определяем номер уровня'''
    lvl=int(input("Введите значение желаемого уровня (от 1 до 5): "))
    print("Возможности уровня: ")
    if lvl>5 or lvl<1:
        print("Неверное значение")
    else:
        if lvl==1:
            print("1. Меняем все символы на заглавные")
            print("2. Меняем все символы на строчные")
            print("3. Делаем все символы строчными, а первый - заглавным")
            m=int(input("Выберите номер метода: "))
            s=input("Введите строку: ")
            if m==1:
                ans=s.upper()
            elif m==2:
                ans=s.lower()
            elif m==3:
                ans=s.capitalize()
            else:
                print("Недопустимый номер")
            print(f'Результат применения метода {m} к строке {s}: {ans}')

            
        if lvl==2:
            print("1. Проверить, есть ли слово в строке")
            print("2. Заменить слово на другое")
            print("3. Посчитать количество конкретных символов в строке")
            print("4. Поиск индекса слова в строке")
            m=int(input("Выберите номер метода: "))
            s=input("Введите строку: ")
            scopy=s
            if m==1:
                word=input("Введите искомое слово: ")
                ans=s.find(word)
                if ans==-1:
                    print(f'Слово {word} не содержится в строке{s}')
                else:
                    print(f'Слово {word} содержится в строке. Позиция первого слова {word} в строке {s}: {ans}')
            elif m==2:
                w1=input("Введите заменяемое слово: ")
                w2=input("Введите новое слово: ")
                while w1 in s:
                    s=s.replace(w1, w2)
                print(f'Результатом замены {w1} на {w2} в строке {scopy} является {s}') 
            elif m==3:
                lit=input("Введите символ: ")
                ans=s.count(lit)
                print(f'Строка {s} содержит {ans} символов {lit}')
            elif m==4:
                word=input("Введите искомое слово: ")
                print(f'Индекс первого слова {word} в строке {s}:{s.index(word)}') 


            
        if lvl==3:
            print("1. Заменить разделители в строке")
            print("2. Разбить строку на слова")
            print("3. Соединить слова в строку")
            m=int(input("Введите номер метода: "))
            
            
            if m==1:
                s=input("Введите строку: ")
                r1=input("Введите разделитель: ")
                r2=input("Введите новый разделитель: ")
                mas=s.split(r1)
                ans=r2.join(mas)
                print(f'После замены разделителя {r1} на {r2} из строки {s} получим строку: {ans}')
            elif m==2:
                s=input("Введите строку: ")
                r1=input("Введите разделитель: ")
                mas=s.split(r1)
                print(f'Разбитая на слова строка {s}: {mas}')
            elif m==3:
                n=int(input("Введите количество слов:"))
                mas=[input() for i in range(n)]
                r1=input("Введите разделитель: ")
                ans=r1.join(mas)
                print(f'Ваша строка {ans}')


                
        if lvl==4:
            print("1. Проверить, является ли строка целым числом или словом")
            print("2. Очистить строку от 'мусора' в начале и в конце")
            print("3. Создать строки по шаблону")
            m=int(input("Введите номер метода: "))
            
            if m==1:
                s=input("Введите строку: ")
                if (s.isdigit() and not (len(s)>1 and s[0]==0)) or (len(s)>1 and s[1:].isdigit() and s[0]=="-" and s[1]!="0"):
                    print("Cтрока является целым числом")
                elif s.isalpha():
                    print("Строка является словом")
                else:
                    print("Строка не является ни словом, ни числом")
            if m==2:
                s=input("Введите строку: ")
                r=input("Перечислите все символы, которые хотите удалить")
                ans=s.strip(r)
                print(ans)
                print('Ваша очищенная строка {0}'.format(ans))
            if m==3:
                s=input("Введите шаблон в формате 'string {0} string {1} string ...': ")
                p=int(input("Сколько подстрок необходимо вставить в данный шаблон? "))
                flag="1"
                while flag=="1":
                    mas=[]
                    for x in range(p):
                        mas.append(input("Введите значение, подставляемое в шаблон "))
                    ans=s.format(*mas)
                    print(f'Ваша строка: {ans}')
                    flag=input("Нажмите 1, если хотите создать еще одну шаблонную строку, или любую другую клавишу для выхода в меню")


        if lvl==5:
            print("Форматирование строки, приведение ее к 'нормальному' виду")
            s=input("Введите строку: ")
            s=s.strip()
            mas=s.split(";")
            s=" ".join(mas)
            s=s.capitalize()
            print(f'Ваша готовая строка: {s}')
                    
                
                    
                    
                
                
                    
                
            
                
                    
                    
                
                

